{
  "result": [
    {
      "criteria_id": 1,
      "explanation": "Текст содержит все необходимые ключевые слова: 'приветствие', 'должность', 'опыт работы'. Грамматика соответствует уровню B1, ошибок не обнаружено. Структура текста полностью соответствует требованиям: приветствие, имя и фамилия, должность, опыт работы, вопросы о новом месте, готовность к работе.",
      "rate": 10
    },
    {
      "criteria_id": 2,
      "explanation": "Произношение четкое, соответствует уровню B1. Качество видео хорошее, разрешение и формат соответствуют требованиям. Темп речи составляет 120 слов в минуту, что находится в пределах нормы (100-150 слов в минуту).",
      "rate": 9
    },
    {
      "criteria_id": 3,
      "explanation": "Задание сдано вовремя, дедлайн соблюден.",
      "rate": 10
    }
  ],
  "stats": [
    {
      "criteria_id": 1,
      "progress_text": "Отличное использование ключевых слов и структуры текста. Грамматика на высоком уровне.",
      "improvements": "Можно добавить больше деталей о вашем опыте работы, чтобы сделать текст еще более информативным.",
      "degradation": "Нет значительных ухудшений.",
      "error_repeat": "Повторяющихся ошибок не обнаружено."
    },
    {
      "criteria_id": 2,
      "progress_text": "Хорошее произношение и качество видео. Темп речи оптимальный.",
      "improvements": "Попробуйте добавить больше эмоциональной выразительности в речь, чтобы сделать ее более живой и engaging.",
      "degradation": "Нет значительных ухудшений.",
      "error_repeat": "Повторяющихся ошибок не обнаружено."
    },
    {
      "criteria_id": 3,
      "progress_text": "Дедлайн соблюден, задание сдано вовремя.",
      "improvements": "Продолжайте соблюдать сроки сдачи заданий.",
      "degradation": "Нет значительных ухудшений.",
      "error_repeat": "Повторяющихся ошибок не обнаружено."
    }
  ],
  "steps": [
    {
      "criteria_id": 1,
      "steps_to_improve": "1. Добавьте больше деталей о вашем опыте работы. 2. Используйте больше профессиональной лексики, связанной с вашей должностью."
    },
    {
      "criteria_id": 2,
      "steps_to_improve": "1. Практикуйте эмоциональную выразительность в речи. 2. Работайте над использованием жестов для усиления воздействия на аудиторию."
    },
    {
      "criteria_id": 3,
      "steps_to_improve": "1. Продолжайте соблюдать сроки сдачи заданий. 2. Планируйте время для выполнения заданий заранее."
    }
  ],
  "dynamics": [
    {
      "skill": "Коммуникация",
      "progress": "Ваши навыки коммуникации находятся на высоком уровне. Вы четко и структурированно излагаете свои мысли, используете профессиональную лексику и соблюдаете грамматические нормы.",
      "next_steps": "1. Практикуйте публичные выступления для улучшения уверенности и эмоциональной выразительности. 2. Участвуйте в дискуссиях и обсуждениях на профессиональные темы для развития навыков взаимодействия с коллегами."
    },
    {
      "skill": "Произношение",
      "progress": "Ваше произношение четкое и соответствует уровню B1. Темп речи оптимальный.",
      "next_steps": "1. Слушайте аудиозаписи носителей языка для улучшения интонации и акцента. 2. Практикуйте скороговорки для улучшения дикции."
    },
    {
      "skill": "Тайм-менеджмент",
      "progress": "Вы отлично справляетесь с соблюдением сроков сдачи заданий.",
      "next_steps": "1. Продолжайте планировать время для выполнения заданий заранее. 2. Используйте инструменты для управления временем, такие как календари и напоминания."
    }
  ]
}
